GopalSaraf/Practicals/PSDL/include/proc/pic16f18456.h
// Register: CWG2PPS
#define CWG2PPS CWG2PPS
extern volatile unsigned char           CWG2PPS             __at(0x1EB2);
#ifndef _LIB_BUILD
asm("CWG2PPS equ 01EB2h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned PIN                    :3;
        unsigned PORT                   :2;
    };
    struct {
        unsigned CWG2PPS                :5;
    };
    struct {
        unsigned CWG2PPS0               :1;
        unsigned CWG2PPS1               :1;
        unsigned CWG2PPS2               :1;
        unsigned CWG2PPS3               :1;
        unsigned CWG2PPS4               :1;
    };
} CWG2PPSbits_t;
extern volatile CWG2PPSbits_t CWG2PPSbits __at(0x1EB2);
// bitfield macros
#define _CWG2PPS_PIN_POSN                                   0x0
#define _CWG2PPS_PIN_POSITION                               0x0
#define _CWG2PPS_PIN_SIZE                                   0x3
#define _CWG2PPS_PIN_LENGTH                                 0x3
#define _CWG2PPS_PIN_MASK                                   0x7
#define _CWG2PPS_PORT_POSN                                  0x3
#define _CWG2PPS_PORT_POSITION                              0x3
#define _CWG2PPS_PORT_SIZE                                  0x2
#define _CWG2PPS_PORT_LENGTH                                0x2
#define _CWG2PPS_PORT_MASK                                  0x18
#define _CWG2PPS_CWG2PPS_POSN                               0x0
#define _CWG2PPS_CWG2PPS_POSITION                           0x0
#define _CWG2PPS_CWG2PPS_SIZE                               0x5
#define _CWG2PPS_CWG2PPS_LENGTH                             0x5
#define _CWG2PPS_CWG2PPS_MASK                               0x1F
#define _CWG2PPS_CWG2PPS0_POSN                              0x0
#define _CWG2PPS_CWG2PPS0_POSITION                          0x0
#define _CWG2PPS_CWG2PPS0_SIZE                              0x1
#define _CWG2PPS_CWG2PPS0_LENGTH                            0x1
#define _CWG2PPS_CWG2PPS0_MASK                              0x1
#define _CWG2PPS_CWG2PPS1_POSN                              0x1
#define _CWG2PPS_CWG2PPS1_POSITION                          0x1
#define _CWG2PPS_CWG2PPS1_SIZE                              0x1
#define _CWG2PPS_CWG2PPS1_LENGTH                            0x1
#define _CWG2PPS_CWG2PPS1_MASK                              0x2
#define _CWG2PPS_CWG2PPS2_POSN                              0x2
#define _CWG2PPS_CWG2PPS2_POSITION                          0x2
#define _CWG2PPS_CWG2PPS2_SIZE                              0x1
#define _CWG2PPS_CWG2PPS2_LENGTH                            0x1
#define _CWG2PPS_CWG2PPS2_MASK                              0x4
#define _CWG2PPS_CWG2PPS3_POSN                              0x3
#define _CWG2PPS_CWG2PPS3_POSITION                          0x3
#define _CWG2PPS_CWG2PPS3_SIZE                              0x1
#define _CWG2PPS_CWG2PPS3_LENGTH                            0x1
#define _CWG2PPS_CWG2PPS3_MASK                              0x8
#define _CWG2PPS_CWG2PPS4_POSN                              0x4
#define _CWG2PPS_CWG2PPS4_POSITION                          0x4
#define _CWG2PPS_CWG2PPS4_SIZE                              0x1
#define _CWG2PPS_CWG2PPS4_LENGTH                            0x1
#define _CWG2PPS_CWG2PPS4_MASK                              0x10

// Register: CWG3PPS
#define CWG3PPS CWG3PPS
extern volatile unsigned char           CWG3PPS             __at(0x1EB3);
#ifndef _LIB_BUILD
asm("CWG3PPS equ 01EB3h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned PIN                    :3;
        unsigned PORT                   :2;
    };
    struct {
        unsigned CWG3PPS                :5;
    };
    struct {
        unsigned CWG3PPS0               :1;
        unsigned CWG3PPS1               :1;
        unsigned CWG3PPS2               :1;
        unsigned CWG3PPS3               :1;
        unsigned CWG3PPS4               :1;
    };
} CWG3PPSbits_t;
extern volatile CWG3PPSbits_t CWG3PPSbits __at(0x1EB3);
// bitfield macros
#define _CWG3PPS_PIN_POSN                                   0x0
#define _CWG3PPS_PIN_POSITION                               0x0
#define _CWG3PPS_PIN_SIZE                                   0x3
#define _CWG3PPS_PIN_LENGTH                                 0x3
#define _CWG3PPS_PIN_MASK                                   0x7
#define _CWG3PPS_PORT_POSN                                  0x3
#define _CWG3PPS_PORT_POSITION                              0x3
#define _CWG3PPS_PORT_SIZE                                  0x2
#define _CWG3PPS_PORT_LENGTH                                0x2
#define _CWG3PPS_PORT_MASK                                  0x18
#define _CWG3PPS_CWG3PPS_POSN                               0x0
#define _CWG3PPS_CWG3PPS_POSITION                           0x0
#define _CWG3PPS_CWG3PPS_SIZE                               0x5
#define _CWG3PPS_CWG3PPS_LENGTH                             0x5
#define _CWG3PPS_CWG3PPS_MASK                               0x1F
#define _CWG3PPS_CWG3PPS0_POSN                              0x0
#define _CWG3PPS_CWG3PPS0_POSITION                          0x0
#define _CWG3PPS_CWG3PPS0_SIZE                              0x1
#define _CWG3PPS_CWG3PPS0_LENGTH                            0x1
#define _CWG3PPS_CWG3PPS0_MASK                              0x1
#define _CWG3PPS_CWG3PPS1_POSN                              0x1
#define _CWG3PPS_CWG3PPS1_POSITION                          0x1
#define _CWG3PPS_CWG3PPS1_SIZE                              0x1
#define _CWG3PPS_CWG3PPS1_LENGTH                            0x1
#define _CWG3PPS_CWG3PPS1_MASK                              0x2
#define _CWG3PPS_CWG3PPS2_POSN                              0x2
#define _CWG3PPS_CWG3PPS2_POSITION                          0x2
#define _CWG3PPS_CWG3PPS2_SIZE                              0x1
#define _CWG3PPS_CWG3PPS2_LENGTH                            0x1
#define _CWG3PPS_CWG3PPS2_MASK                              0x4
#define _CWG3PPS_CWG3PPS3_POSN                              0x3
#define _CWG3PPS_CWG3PPS3_POSITION                          0x3
#define _CWG3PPS_CWG3PPS3_SIZE                              0x1
#define _CWG3PPS_CWG3PPS3_LENGTH                            0x1
#define _CWG3PPS_CWG3PPS3_MASK                              0x8
#define _CWG3PPS_CWG3PPS4_POSN                              0x4
#define _CWG3PPS_CWG3PPS4_POSITION                          0x4
#define _CWG3PPS_CWG3PPS4_SIZE                              0x1
#define _CWG3PPS_CWG3PPS4_LENGTH                            0x1
#define _CWG3PPS_CWG3PPS4_MASK                              0x10

// Register: MDCARLPPS
#define MDCARLPPS MDCARLPPS
extern volatile unsigned char           MDCARLPPS           __at(0x1EB8);
#ifndef _LIB_BUILD
asm("MDCARLPPS equ 01EB8h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned PIN                    :3;
        unsigned PORT                   :2;
    };
    struct {
        unsigned MDCARLPPS              :5;
    };
    struct {
        unsigned MDCARLPPS0             :1;
        unsigned MDCARLPPS1             :1;
        unsigned MDCARLPPS2             :1;
        unsigned MDCARLPPS3             :1;
        unsigned MDCARLPPS4             :1;
    };
} MDCARLPPSbits_t;
extern volatile MDCARLPPSbits_t MDCARLPPSbits __at(0x1EB8);
// bitfield macros
#define _MDCARLPPS_PIN_POSN                                 0x0
#define _MDCARLPPS_PIN_POSITION                             0x0
#define _MDCARLPPS_PIN_SIZE                                 0x3
#define _MDCARLPPS_PIN_LENGTH                               0x3
#define _MDCARLPPS_PIN_MASK                                 0x7
#define _MDCARLPPS_PORT_POSN                                0x3
#define _MDCARLPPS_PORT_POSITION                            0x3
#define _MDCARLPPS_PORT_SIZE                                0x2
#define _MDCARLPPS_PORT_LENGTH                              0x2
#define _MDCARLPPS_PORT_MASK                                0x18
#define _MDCARLPPS_MDCARLPPS_POSN                           0x0
#define _MDCARLPPS_MDCARLPPS_POSITION                       0x0
#define _MDCARLPPS_MDCARLPPS_SIZE                           0x5
#define _MDCARLPPS_MDCARLPPS_LENGTH                         0x5
#define _MDCARLPPS_MDCARLPPS_MASK                           0x1F
#define _MDCARLPPS_MDCARLPPS0_POSN                          0x0
#define _MDCARLPPS_MDCARLPPS0_POSITION                      0x0
#define _MDCARLPPS_MDCARLPPS0_SIZE                          0x1
#define _MDCARLPPS_MDCARLPPS0_LENGTH                        0x1
#define _MDCARLPPS_MDCARLPPS0_MASK                          0x1
#define _MDCARLPPS_MDCARLPPS1_POSN                          0x1
#define _MDCARLPPS_MDCARLPPS1_POSITION                      0x1
#define _MDCARLPPS_MDCARLPPS1_SIZE                          0x1
#define _MDCARLPPS_MDCARLPPS1_LENGTH                        0x1
#define _MDCARLPPS_MDCARLPPS1_MASK                          0x2
#define _MDCARLPPS_MDCARLPPS2_POSN                          0x2
#define _MDCARLPPS_MDCARLPPS2_POSITION                      0x2
#define _MDCARLPPS_MDCARLPPS2_SIZE                          0x1
#define _MDCARLPPS_MDCARLPPS2_LENGTH                        0x1
#define _MDCARLPPS_MDCARLPPS2_MASK                          0x4
#define _MDCARLPPS_MDCARLPPS3_POSN                          0x3
#define _MDCARLPPS_MDCARLPPS3_POSITION                      0x3
#define _MDCARLPPS_MDCARLPPS3_SIZE                          0x1
#define _MDCARLPPS_MDCARLPPS3_LENGTH                        0x1
#define _MDCARLPPS_MDCARLPPS3_MASK                          0x8
#define _MDCARLPPS_MDCARLPPS4_POSN                          0x4
#define _MDCARLPPS_MDCARLPPS4_POSITION                      0x4
#define _MDCARLPPS_MDCARLPPS4_SIZE                          0x1
#define _MDCARLPPS_MDCARLPPS4_LENGTH                        0x1
#define _MDCARLPPS_MDCARLPPS4_MASK                          0x10

// Register: MDCARHPPS
#define MDCARHPPS MDCARHPPS
extern volatile unsigned char           MDCARHPPS           __at(0x1EB9);
#ifndef _LIB_BUILD
asm("MDCARHPPS equ 01EB9h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned PIN                    :3;
        unsigned PORT                   :2;
    };
    struct {
        unsigned MDCARHPPS              :5;
    };
    struct {
        unsigned MDCARHPPS0             :1;
        unsigned MDCARHPPS1             :1;
        unsigned MDCARHPPS2             :1;
        unsigned MDCARHPPS3             :1;
        unsigned MDCARHPPS4             :1;
    };
} MDCARHPPSbits_t;
extern volatile MDCARHPPSbits_t MDCARHPPSbits __at(0x1EB9);
// bitfield macros
#define _MDCARHPPS_PIN_POSN                                 0x0
#define _MDCARHPPS_PIN_POSITION                             0x0
#define _MDCARHPPS_PIN_SIZE                                 0x3
#define _MDCARHPPS_PIN_LENGTH                               0x3
#define _MDCARHPPS_PIN_MASK                                 0x7
#define _MDCARHPPS_PORT_POSN                                0x3
#define _MDCARHPPS_PORT_POSITION                            0x3
#define _MDCARHPPS_PORT_SIZE                                0x2
#define _MDCARHPPS_PORT_LENGTH                              0x2
#define _MDCARHPPS_PORT_MASK                                0x18
#define _MDCARHPPS_MDCARHPPS_POSN                           0x0
#define _MDCARHPPS_MDCARHPPS_POSITION                       0x0
#define _MDCARHPPS_MDCARHPPS_SIZE                           0x5
#define _MDCARHPPS_MDCARHPPS_LENGTH                         0x5
#define _MDCARHPPS_MDCARHPPS_MASK                           0x1F
#define _MDCARHPPS_MDCARHPPS0_POSN                          0x0
#define _MDCARHPPS_MDCARHPPS0_POSITION                      0x0
#define _MDCARHPPS_MDCARHPPS0_SIZE                          0x1
#define _MDCARHPPS_MDCARHPPS0_LENGTH                        0x1
#define _MDCARHPPS_MDCARHPPS0_MASK                          0x1
#define _MDCARHPPS_MDCARHPPS1_POSN                          0x1
#define _MDCARHPPS_MDCARHPPS1_POSITION                      0x1
#define _MDCARHPPS_MDCARHPPS1_SIZE                          0x1
#define _MDCARHPPS_MDCARHPPS1_LENGTH                        0x1
#define _MDCARHPPS_MDCARHPPS1_MASK                          0x2
#define _MDCARHPPS_MDCARHPPS2_POSN                          0x2
#define _MDCARHPPS_MDCARHPPS2_POSITION                      0x2
#define _MDCARHPPS_MDCARHPPS2_SIZE                          0x1
#define _MDCARHPPS_MDCARHPPS2_LENGTH                        0x1
#define _MDCARHPPS_MDCARHPPS2_MASK                          0x4
#define _MDCARHPPS_MDCARHPPS3_POSN                          0x3
#define _MDCARHPPS_MDCARHPPS3_POSITION                      0x3
#define _MDCARHPPS_MDCARHPPS3_SIZE                          0x1
#define _MDCARHPPS_MDCARHPPS3_LENGTH                        0x1
#define _MDCARHPPS_MDCARHPPS3_MASK                          0x8
#define _MDCARHPPS_MDCARHPPS4_POSN                          0x4
#define _MDCARHPPS_MDCARHPPS4_POSITION                      0x4
#define _MDCARHPPS_MDCARHPPS4_SIZE                          0x1
#define _MDCARHPPS_MDCARHPPS4_LENGTH                        0x1
#define _MDCARHPPS_MDCARHPPS4_MASK                          0x10

// Register: MDSRCPPS
#define MDSRCPPS MDSRCPPS
extern volatile unsigned char           MDSRCPPS            __at(0x1EBA);
#ifndef _LIB_BUILD
asm("MDSRCPPS equ 01EBAh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned PIN                    :3;
        unsigned PORT                   :2;
    };
    struct {
        unsigned MDSRCPPS               :5;
    };
    struct {
        unsigned MDSRCPPS0              :1;
        unsigned MDSRCPPS1              :1;
        unsigned MDSRCPPS2              :1;
        unsigned MDSRCPPS3              :1;
        unsigned MDSRCPPS4              :1;
    };
} MDSRCPPSbits_t;
extern volatile MDSRCPPSbits_t MDSRCPPSbits __at(0x1EBA);
// bitfield macros
#define _MDSRCPPS_PIN_POSN                                  0x0
#define _MDSRCPPS_PIN_POSITION                              0x0
#define _MDSRCPPS_PIN_SIZE                                  0x3
#define _MDSRCPPS_PIN_LENGTH                                0x3
#define _MDSRCPPS_PIN_MASK                                  0x7
#define _MDSRCPPS_PORT_POSN                                 0x3
#define _MDSRCPPS_PORT_POSITION                             0x3
#define _MDSRCPPS_PORT_SIZE                                 0x2
#define _MDSRCPPS_PORT_LENGTH                               0x2
#define _MDSRCPPS_PORT_MASK                                 0x18
#define _MDSRCPPS_MDSRCPPS_POSN                             0x0
#define _MDSRCPPS_MDSRCPPS_POSITION                         0x0
#define _MDSRCPPS_MDSRCPPS_SIZE                             0x5
#define _MDSRCPPS_MDSRCPPS_LENGTH                           0x5
#define _MDSRCPPS_MDSRCPPS_MASK                             0x1F
#define _MDSRCPPS_MDSRCPPS0_POSN                            0x0
#define _MDSRCPPS_MDSRCPPS0_POSITION                        0x0
#define _MDSRCPPS_MDSRCPPS0_SIZE                            0x1
#define _MDSRCPPS_MDSRCPPS0_LENGTH                          0x1
#define _MDSRCPPS_MDSRCPPS0_MASK                            0x1
#define _MDSRCPPS_MDSRCPPS1_POSN                            0x1
#define _MDSRCPPS_MDSRCPPS1_POSITION                        0x1
#define _MDSRCPPS_MDSRCPPS1_SIZE                            0x1
#define _MDSRCPPS_MDSRCPPS1_LENGTH                          0x1
#define _MDSRCPPS_MDSRCPPS1_MASK                            0x2
#define _MDSRCPPS_MDSRCPPS2_POSN                            0x2
#define _MDSRCPPS_MDSRCPPS2_POSITION                        0x2
#define _MDSRCPPS_MDSRCPPS2_SIZE                            0x1
#define _MDSRCPPS_MDSRCPPS2_LENGTH                          0x1
#define _MDSRCPPS_MDSRCPPS2_MASK                            0x4
#define _MDSRCPPS_MDSRCPPS3_POSN                            0x3
#define _MDSRCPPS_MDSRCPPS3_POSITION                        0x3
#define _MDSRCPPS_MDSRCPPS3_SIZE                            0x1
#define _MDSRCPPS_MDSRCPPS3_LENGTH                          0x1
#define _MDSRCPPS_MDSRCPPS3_MASK                            0x8
#define _MDSRCPPS_MDSRCPPS4_POSN                            0x4
#define _MDSRCPPS_MDSRCPPS4_POSITION                        0x4
#define _MDSRCPPS_MDSRCPPS4_SIZE                            0x1
#define _MDSRCPPS_MDSRCPPS4_LENGTH                          0x1
#define _MDSRCPPS_MDSRCPPS4_MASK                            0x10

