GopalSaraf/Practicals/PSDL/include/proc/pic16f18456.h
extern volatile RX2DTPPSbits_t RX2DTPPSbits __at(0x1ECD);
// bitfield macros
#define _RX2DTPPS_PIN_POSN                                  0x0
#define _RX2DTPPS_PIN_POSITION                              0x0
#define _RX2DTPPS_PIN_SIZE                                  0x3
#define _RX2DTPPS_PIN_LENGTH                                0x3
#define _RX2DTPPS_PIN_MASK                                  0x7
#define _RX2DTPPS_PORT_POSN                                 0x3
#define _RX2DTPPS_PORT_POSITION                             0x3
#define _RX2DTPPS_PORT_SIZE                                 0x2
#define _RX2DTPPS_PORT_LENGTH                               0x2
#define _RX2DTPPS_PORT_MASK                                 0x18
#define _RX2DTPPS_RX2PPS_POSN                               0x0
#define _RX2DTPPS_RX2PPS_POSITION                           0x0
#define _RX2DTPPS_RX2PPS_SIZE                               0x5
#define _RX2DTPPS_RX2PPS_LENGTH                             0x5
#define _RX2DTPPS_RX2PPS_MASK                               0x1F
#define _RX2DTPPS_RX2PPS0_POSN                              0x0
#define _RX2DTPPS_RX2PPS0_POSITION                          0x0
#define _RX2DTPPS_RX2PPS0_SIZE                              0x1
#define _RX2DTPPS_RX2PPS0_LENGTH                            0x1
#define _RX2DTPPS_RX2PPS0_MASK                              0x1
#define _RX2DTPPS_RX2PPS1_POSN                              0x1
#define _RX2DTPPS_RX2PPS1_POSITION                          0x1
#define _RX2DTPPS_RX2PPS1_SIZE                              0x1
#define _RX2DTPPS_RX2PPS1_LENGTH                            0x1
#define _RX2DTPPS_RX2PPS1_MASK                              0x2
#define _RX2DTPPS_RX2PPS2_POSN                              0x2
#define _RX2DTPPS_RX2PPS2_POSITION                          0x2
#define _RX2DTPPS_RX2PPS2_SIZE                              0x1
#define _RX2DTPPS_RX2PPS2_LENGTH                            0x1
#define _RX2DTPPS_RX2PPS2_MASK                              0x4
#define _RX2DTPPS_RX2PPS3_POSN                              0x3
#define _RX2DTPPS_RX2PPS3_POSITION                          0x3
#define _RX2DTPPS_RX2PPS3_SIZE                              0x1
#define _RX2DTPPS_RX2PPS3_LENGTH                            0x1
#define _RX2DTPPS_RX2PPS3_MASK                              0x8
#define _RX2DTPPS_RX2PPS4_POSN                              0x4
#define _RX2DTPPS_RX2PPS4_POSITION                          0x4
#define _RX2DTPPS_RX2PPS4_SIZE                              0x1
#define _RX2DTPPS_RX2PPS4_LENGTH                            0x1
#define _RX2DTPPS_RX2PPS4_MASK                              0x10

// Register: CK2PPS
#define CK2PPS CK2PPS
extern volatile unsigned char           CK2PPS              __at(0x1ECE);
#ifndef _LIB_BUILD
asm("CK2PPS equ 01ECEh");
#endif
// aliases
extern volatile unsigned char           TX2CKPPS            __at(0x1ECE);
#ifndef _LIB_BUILD
asm("TX2CKPPS equ 01ECEh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned PIN                    :3;
        unsigned PORT                   :2;
    };
    struct {
        unsigned CK2PPS                 :5;
    };
    struct {
        unsigned TX2CKPPS               :5;
    };
    struct {
        unsigned TX2CKPPS0              :1;
        unsigned TX2CKPPS1              :1;
        unsigned TX2CKPPS2              :1;
        unsigned TX2CKPPS3              :1;
        unsigned TX2CKPPS4              :1;
    };
} CK2PPSbits_t;
extern volatile CK2PPSbits_t CK2PPSbits __at(0x1ECE);
// bitfield macros
#define _CK2PPS_PIN_POSN                                    0x0
#define _CK2PPS_PIN_POSITION                                0x0
#define _CK2PPS_PIN_SIZE                                    0x3
#define _CK2PPS_PIN_LENGTH                                  0x3
#define _CK2PPS_PIN_MASK                                    0x7
#define _CK2PPS_PORT_POSN                                   0x3
#define _CK2PPS_PORT_POSITION                               0x3
#define _CK2PPS_PORT_SIZE                                   0x2
#define _CK2PPS_PORT_LENGTH                                 0x2
#define _CK2PPS_PORT_MASK                                   0x18
#define _CK2PPS_CK2PPS_POSN                                 0x0
#define _CK2PPS_CK2PPS_POSITION                             0x0
#define _CK2PPS_CK2PPS_SIZE                                 0x5
#define _CK2PPS_CK2PPS_LENGTH                               0x5
#define _CK2PPS_CK2PPS_MASK                                 0x1F
#define _CK2PPS_TX2CKPPS_POSN                               0x0
#define _CK2PPS_TX2CKPPS_POSITION                           0x0
#define _CK2PPS_TX2CKPPS_SIZE                               0x5
#define _CK2PPS_TX2CKPPS_LENGTH                             0x5
#define _CK2PPS_TX2CKPPS_MASK                               0x1F
#define _CK2PPS_TX2CKPPS0_POSN                              0x0
#define _CK2PPS_TX2CKPPS0_POSITION                          0x0
#define _CK2PPS_TX2CKPPS0_SIZE                              0x1
#define _CK2PPS_TX2CKPPS0_LENGTH                            0x1
#define _CK2PPS_TX2CKPPS0_MASK                              0x1
#define _CK2PPS_TX2CKPPS1_POSN                              0x1
#define _CK2PPS_TX2CKPPS1_POSITION                          0x1
#define _CK2PPS_TX2CKPPS1_SIZE                              0x1
#define _CK2PPS_TX2CKPPS1_LENGTH                            0x1
#define _CK2PPS_TX2CKPPS1_MASK                              0x2
#define _CK2PPS_TX2CKPPS2_POSN                              0x2
#define _CK2PPS_TX2CKPPS2_POSITION                          0x2
#define _CK2PPS_TX2CKPPS2_SIZE                              0x1
#define _CK2PPS_TX2CKPPS2_LENGTH                            0x1
#define _CK2PPS_TX2CKPPS2_MASK                              0x4
#define _CK2PPS_TX2CKPPS3_POSN                              0x3
#define _CK2PPS_TX2CKPPS3_POSITION                          0x3
#define _CK2PPS_TX2CKPPS3_SIZE                              0x1
#define _CK2PPS_TX2CKPPS3_LENGTH                            0x1
#define _CK2PPS_TX2CKPPS3_MASK                              0x8
#define _CK2PPS_TX2CKPPS4_POSN                              0x4
#define _CK2PPS_TX2CKPPS4_POSITION                          0x4
#define _CK2PPS_TX2CKPPS4_SIZE                              0x1
#define _CK2PPS_TX2CKPPS4_LENGTH                            0x1
#define _CK2PPS_TX2CKPPS4_MASK                              0x10
// alias bitfield definitions
typedef union {
    struct {
        unsigned PIN                    :3;
        unsigned PORT                   :2;
    };
    struct {
        unsigned CK2PPS                 :5;
    };
    struct {
        unsigned TX2CKPPS               :5;
    };
    struct {
        unsigned TX2CKPPS0              :1;
        unsigned TX2CKPPS1              :1;
        unsigned TX2CKPPS2              :1;
        unsigned TX2CKPPS3              :1;
        unsigned TX2CKPPS4              :1;
    };
} TX2CKPPSbits_t;
