GopalSaraf/Practicals/PSDL/include/proc/pic16f18456.h
extern volatile __bit                   DAC1R1              __at(0x4879);	// @ (0x90F * 8 + 1)
#define                                 DAC1R1_bit          _BIT_ACCESS(DAC1CON1,1)
// DAC1CON1<DAC1R2>
extern volatile __bit                   DAC1R2              __at(0x487A);	// @ (0x90F * 8 + 2)
#define                                 DAC1R2_bit          _BIT_ACCESS(DAC1CON1,2)
// DAC1CON1<DAC1R3>
extern volatile __bit                   DAC1R3              __at(0x487B);	// @ (0x90F * 8 + 3)
#define                                 DAC1R3_bit          _BIT_ACCESS(DAC1CON1,3)
// DAC1CON1<DAC1R4>
extern volatile __bit                   DAC1R4              __at(0x487C);	// @ (0x90F * 8 + 4)
#define                                 DAC1R4_bit          _BIT_ACCESS(DAC1CON1,4)
// SSP1STAT<DATA_ADDRESS1>
extern volatile __bit                   DATA_ADDRESS1       __at(0xC7D);	// @ (0x18F * 8 + 5)
#define                                 DATA_ADDRESS1_bit   _BIT_ACCESS(SSP1STAT,5)
// SSP2STAT<DATA_ADDRESS2>
extern volatile __bit                   DATA_ADDRESS2       __at(0xCCD);	// @ (0x199 * 8 + 5)
#define                                 DATA_ADDRESS2_bit   _BIT_ACCESS(SSP2STAT,5)
// STATUS<DC>
extern volatile __bit                   DC                  __at(0x19);	// @ (0x3 * 8 + 1)
#define                                 DC_bit              _BIT_ACCESS(STATUS,1)
// CPUDOZE<DOE>
extern volatile __bit                   DOE                 __at(0x4464);	// @ (0x88C * 8 + 4)
#define                                 DOE_bit             _BIT_ACCESS(CPUDOZE,4)
// ADCON0<DONE>
extern volatile __bit                   DONE                __at(0x888);	// @ (0x111 * 8 + 0)
#define                                 DONE_bit            _BIT_ACCESS(ADCON0,0)
// CPUDOZE<DOZE0>
extern volatile __bit                   DOZE0               __at(0x4460);	// @ (0x88C * 8 + 0)
#define                                 DOZE0_bit           _BIT_ACCESS(CPUDOZE,0)
// CPUDOZE<DOZE1>
extern volatile __bit                   DOZE1               __at(0x4461);	// @ (0x88C * 8 + 1)
#define                                 DOZE1_bit           _BIT_ACCESS(CPUDOZE,1)
// CPUDOZE<DOZE2>
extern volatile __bit                   DOZE2               __at(0x4462);	// @ (0x88C * 8 + 2)
#define                                 DOZE2_bit           _BIT_ACCESS(CPUDOZE,2)
// CPUDOZE<DOZEN>
extern volatile __bit                   DOZEN               __at(0x4466);	// @ (0x88C * 8 + 6)
#define                                 DOZEN_bit           _BIT_ACCESS(CPUDOZE,6)
// ADCON1<DSEN>
extern volatile __bit                   DSEN                __at(0x890);	// @ (0x112 * 8 + 0)
#define                                 DSEN_bit            _BIT_ACCESS(ADCON1,0)
// PMD7<DSM1MD>
extern volatile __bit                   DSM1MD              __at(0x3CE8);	// @ (0x79D * 8 + 0)
#define                                 DSM1MD_bit          _BIT_ACCESS(PMD7,0)
// SSP1STAT<D_A1>
extern volatile __bit                   D_A1                __at(0xC7D);	// @ (0x18F * 8 + 5)
#define                                 D_A1_bit            _BIT_ACCESS(SSP1STAT,5)
// SSP2STAT<D_A2>
extern volatile __bit                   D_A2                __at(0xCCD);	// @ (0x199 * 8 + 5)
#define                                 D_A2_bit            _BIT_ACCESS(SSP2STAT,5)
// SSP1STAT<D_nA1>
extern volatile __bit                   D_nA1               __at(0xC7D);	// @ (0x18F * 8 + 5)
#define                                 D_nA1_bit           _BIT_ACCESS(SSP1STAT,5)
// SSP2STAT<D_nA2>
extern volatile __bit                   D_nA2               __at(0xCCD);	// @ (0x199 * 8 + 5)
#define                                 D_nA2_bit           _BIT_ACCESS(SSP2STAT,5)
// ADERRL<ERR0>
extern volatile __bit                   ERR0                __at(0x480);	// @ (0x90 * 8 + 0)
#define                                 ERR0_bit            _BIT_ACCESS(ADERRL,0)
// ADERRL<ERR1>
extern volatile __bit                   ERR1                __at(0x481);	// @ (0x90 * 8 + 1)
#define                                 ERR1_bit            _BIT_ACCESS(ADERRL,1)
// ADERRH<ERR10>
extern volatile __bit                   ERR10               __at(0x48A);	// @ (0x91 * 8 + 2)
#define                                 ERR10_bit           _BIT_ACCESS(ADERRH,2)
// ADERRH<ERR11>
extern volatile __bit                   ERR11               __at(0x48B);	// @ (0x91 * 8 + 3)
#define                                 ERR11_bit           _BIT_ACCESS(ADERRH,3)
// ADERRH<ERR12>
extern volatile __bit                   ERR12               __at(0x48C);	// @ (0x91 * 8 + 4)
#define                                 ERR12_bit           _BIT_ACCESS(ADERRH,4)
// ADERRH<ERR13>
extern volatile __bit                   ERR13               __at(0x48D);	// @ (0x91 * 8 + 5)
#define                                 ERR13_bit           _BIT_ACCESS(ADERRH,5)
// ADERRH<ERR14>
extern volatile __bit                   ERR14               __at(0x48E);	// @ (0x91 * 8 + 6)
#define                                 ERR14_bit           _BIT_ACCESS(ADERRH,6)
// ADERRH<ERR15>
extern volatile __bit                   ERR15               __at(0x48F);	// @ (0x91 * 8 + 7)
#define                                 ERR15_bit           _BIT_ACCESS(ADERRH,7)
// ADERRL<ERR2>
extern volatile __bit                   ERR2                __at(0x482);	// @ (0x90 * 8 + 2)
#define                                 ERR2_bit            _BIT_ACCESS(ADERRL,2)
// ADERRL<ERR3>
extern volatile __bit                   ERR3                __at(0x483);	// @ (0x90 * 8 + 3)
#define                                 ERR3_bit            _BIT_ACCESS(ADERRL,3)
// ADERRL<ERR4>
extern volatile __bit                   ERR4                __at(0x484);	// @ (0x90 * 8 + 4)
#define                                 ERR4_bit            _BIT_ACCESS(ADERRL,4)
// ADERRL<ERR5>
extern volatile __bit                   ERR5                __at(0x485);	// @ (0x90 * 8 + 5)
#define                                 ERR5_bit            _BIT_ACCESS(ADERRL,5)
// ADERRL<ERR6>
extern volatile __bit                   ERR6                __at(0x486);	// @ (0x90 * 8 + 6)
#define                                 ERR6_bit            _BIT_ACCESS(ADERRL,6)
// ADERRL<ERR7>
extern volatile __bit                   ERR7                __at(0x487);	// @ (0x90 * 8 + 7)
#define                                 ERR7_bit            _BIT_ACCESS(ADERRL,7)
// ADERRH<ERR8>
extern volatile __bit                   ERR8                __at(0x488);	// @ (0x91 * 8 + 0)
#define                                 ERR8_bit            _BIT_ACCESS(ADERRH,0)
// ADERRH<ERR9>
extern volatile __bit                   ERR9                __at(0x489);	// @ (0x91 * 8 + 1)
#define                                 ERR9_bit            _BIT_ACCESS(ADERRH,1)
// OSCEN<EXTOEN>
extern volatile __bit                   EXTOEN              __at(0x448F);	// @ (0x891 * 8 + 7)
#define                                 EXTOEN_bit          _BIT_ACCESS(OSCEN,7)
// OSCSTAT<EXTOR>
extern volatile __bit                   EXTOR               __at(0x4487);	// @ (0x890 * 8 + 7)
#define                                 EXTOR_bit           _BIT_ACCESS(OSCSTAT,7)
// ADFLTRL<FLTR0>
extern volatile __bit                   FLTR0               __at(0x4A0);	// @ (0x94 * 8 + 0)
#define                                 FLTR0_bit           _BIT_ACCESS(ADFLTRL,0)
// ADFLTRL<FLTR1>
extern volatile __bit                   FLTR1               __at(0x4A1);	// @ (0x94 * 8 + 1)
#define                                 FLTR1_bit           _BIT_ACCESS(ADFLTRL,1)
// ADFLTRH<FLTR10>
extern volatile __bit                   FLTR10              __at(0x4AA);	// @ (0x95 * 8 + 2)
#define                                 FLTR10_bit          _BIT_ACCESS(ADFLTRH,2)
// ADFLTRH<FLTR11>
extern volatile __bit                   FLTR11              __at(0x4AB);	// @ (0x95 * 8 + 3)
#define                                 FLTR11_bit          _BIT_ACCESS(ADFLTRH,3)
// ADFLTRH<FLTR12>
extern volatile __bit                   FLTR12              __at(0x4AC);	// @ (0x95 * 8 + 4)
#define                                 FLTR12_bit          _BIT_ACCESS(ADFLTRH,4)
// ADFLTRH<FLTR13>
extern volatile __bit                   FLTR13              __at(0x4AD);	// @ (0x95 * 8 + 5)
#define                                 FLTR13_bit          _BIT_ACCESS(ADFLTRH,5)
// ADFLTRH<FLTR14>
extern volatile __bit                   FLTR14              __at(0x4AE);	// @ (0x95 * 8 + 6)
#define                                 FLTR14_bit          _BIT_ACCESS(ADFLTRH,6)
// ADFLTRH<FLTR15>
extern volatile __bit                   FLTR15              __at(0x4AF);	// @ (0x95 * 8 + 7)
#define                                 FLTR15_bit          _BIT_ACCESS(ADFLTRH,7)
// ADFLTRL<FLTR2>
extern volatile __bit                   FLTR2               __at(0x4A2);	// @ (0x94 * 8 + 2)
#define                                 FLTR2_bit           _BIT_ACCESS(ADFLTRL,2)
// ADFLTRL<FLTR3>
extern volatile __bit                   FLTR3               __at(0x4A3);	// @ (0x94 * 8 + 3)
#define                                 FLTR3_bit           _BIT_ACCESS(ADFLTRL,3)
// ADFLTRL<FLTR4>
extern volatile __bit                   FLTR4               __at(0x4A4);	// @ (0x94 * 8 + 4)
#define                                 FLTR4_bit           _BIT_ACCESS(ADFLTRL,4)
// ADFLTRL<FLTR5>
extern volatile __bit                   FLTR5               __at(0x4A5);	// @ (0x94 * 8 + 5)
#define                                 FLTR5_bit           _BIT_ACCESS(ADFLTRL,5)
// ADFLTRL<FLTR6>
extern volatile __bit                   FLTR6               __at(0x4A6);	// @ (0x94 * 8 + 6)
#define                                 FLTR6_bit           _BIT_ACCESS(ADFLTRL,6)
// ADFLTRL<FLTR7>
extern volatile __bit                   FLTR7               __at(0x4A7);	// @ (0x94 * 8 + 7)
#define                                 FLTR7_bit           _BIT_ACCESS(ADFLTRL,7)
// ADFLTRH<FLTR8>
extern volatile __bit                   FLTR8               __at(0x4A8);	// @ (0x95 * 8 + 0)
#define                                 FLTR8_bit           _BIT_ACCESS(ADFLTRH,0)
// ADFLTRH<FLTR9>
extern volatile __bit                   FLTR9               __at(0x4A9);	// @ (0x95 * 8 + 1)
#define                                 FLTR9_bit           _BIT_ACCESS(ADFLTRH,1)
// ADCON0<FM0>
extern volatile __bit                   FM0                 __at(0x88A);	// @ (0x111 * 8 + 2)
#define                                 FM0_bit             _BIT_ACCESS(ADCON0,2)
// NVMCON1<FREE>
extern volatile __bit                   FREE                __at(0x40F4);	// @ (0x81E * 8 + 4)
#define                                 FREE_bit            _BIT_ACCESS(NVMCON1,4)
// FVRCON<FVREN>
extern volatile __bit                   FVREN               __at(0x4867);	// @ (0x90C * 8 + 7)
#define                                 FVREN_bit           _BIT_ACCESS(FVRCON,7)
// PMD0<FVRMD>
extern volatile __bit                   FVRMD               __at(0x3CB6);	// @ (0x796 * 8 + 6)
#define                                 FVRMD_bit           _BIT_ACCESS(PMD0,6)
// FVRCON<FVRRDY>
extern volatile __bit                   FVRRDY              __at(0x4866);	// @ (0x90C * 8 + 6)
#define                                 FVRRDY_bit          _BIT_ACCESS(FVRCON,6)
// CWG1CON0<G1EN>
extern volatile __bit                   G1EN                __at(0x3087);	// @ (0x610 * 8 + 7)
#define                                 G1EN_bit            _BIT_ACCESS(CWG1CON0,7)
// CWG2CON0<G2EN>
extern volatile __bit                   G2EN                __at(0x30D7);	// @ (0x61A * 8 + 7)
#define                                 G2EN_bit            _BIT_ACCESS(CWG2CON0,7)
// CWG3CON0<G3EN>
extern volatile __bit                   G3EN                __at(0x3487);	// @ (0x690 * 8 + 7)
#define                                 G3EN_bit            _BIT_ACCESS(CWG3CON0,7)
// ADCON1<GAOE>
extern volatile __bit                   GAOE                __at(0x894);	// @ (0x112 * 8 + 4)
#define                                 GAOE_bit            _BIT_ACCESS(ADCON1,4)
// ADCON1<GBOE>
extern volatile __bit                   GBOE                __at(0x893);	// @ (0x112 * 8 + 3)
#define                                 GBOE_bit            _BIT_ACCESS(ADCON1,3)
// SSP1CON2<GCEN1>
extern volatile __bit                   GCEN1               __at(0xC8F);	// @ (0x191 * 8 + 7)
#define                                 GCEN1_bit           _BIT_ACCESS(SSP1CON2,7)
// SSP2CON2<GCEN2>
extern volatile __bit                   GCEN2               __at(0xCDF);	// @ (0x19B * 8 + 7)
#define                                 GCEN2_bit           _BIT_ACCESS(SSP2CON2,7)
// INTCON<GIE>
extern volatile __bit                   GIE                 __at(0x5F);	// @ (0xB * 8 + 7)
#define                                 GIE_bit             _BIT_ACCESS(INTCON,7)
// ADCON0<GO_nDONE>
extern volatile __bit                   GO_nDONE            __at(0x888);	// @ (0x111 * 8 + 0)
#define                                 GO_nDONE_bit        _BIT_ACCESS(ADCON0,0)
// OSCFRQ<HFFRQ0>
extern volatile __bit                   HFFRQ0              __at(0x4498);	// @ (0x893 * 8 + 0)
#define                                 HFFRQ0_bit          _BIT_ACCESS(OSCFRQ,0)
// OSCFRQ<HFFRQ1>
extern volatile __bit                   HFFRQ1              __at(0x4499);	// @ (0x893 * 8 + 1)
#define                                 HFFRQ1_bit          _BIT_ACCESS(OSCFRQ,1)
// OSCFRQ<HFFRQ2>
extern volatile __bit                   HFFRQ2              __at(0x449A);	// @ (0x893 * 8 + 2)
#define                                 HFFRQ2_bit          _BIT_ACCESS(OSCFRQ,2)
// OSCEN<HFOEN>
extern volatile __bit                   HFOEN               __at(0x448E);	// @ (0x891 * 8 + 6)
#define                                 HFOEN_bit           _BIT_ACCESS(OSCEN,6)
// OSCSTAT<HFOR>
extern volatile __bit                   HFOR                __at(0x4486);	// @ (0x890 * 8 + 6)
#define                                 HFOR_bit            _BIT_ACCESS(OSCSTAT,6)
// OSCTUNE<HFTUN0>
extern volatile __bit                   HFTUN0              __at(0x4490);	// @ (0x892 * 8 + 0)
#define                                 HFTUN0_bit          _BIT_ACCESS(OSCTUNE,0)
// OSCTUNE<HFTUN1>
extern volatile __bit                   HFTUN1              __at(0x4491);	// @ (0x892 * 8 + 1)
#define                                 HFTUN1_bit          _BIT_ACCESS(OSCTUNE,1)
// OSCTUNE<HFTUN2>
extern volatile __bit                   HFTUN2              __at(0x4492);	// @ (0x892 * 8 + 2)
#define                                 HFTUN2_bit          _BIT_ACCESS(OSCTUNE,2)
// OSCTUNE<HFTUN3>
extern volatile __bit                   HFTUN3              __at(0x4493);	// @ (0x892 * 8 + 3)
#define                                 HFTUN3_bit          _BIT_ACCESS(OSCTUNE,3)
// OSCTUNE<HFTUN4>
extern volatile __bit                   HFTUN4              __at(0x4494);	// @ (0x892 * 8 + 4)
#define                                 HFTUN4_bit          _BIT_ACCESS(OSCTUNE,4)
// OSCTUNE<HFTUN5>
extern volatile __bit                   HFTUN5              __at(0x4495);	// @ (0x892 * 8 + 5)
#define                                 HFTUN5_bit          _BIT_ACCESS(OSCTUNE,5)
// SSP1STAT<I2C_DAT1>
extern volatile __bit                   I2C_DAT1            __at(0xC7D);	// @ (0x18F * 8 + 5)
#define                                 I2C_DAT1_bit        _BIT_ACCESS(SSP1STAT,5)
// SSP2STAT<I2C_DAT2>
extern volatile __bit                   I2C_DAT2            __at(0xCCD);	// @ (0x199 * 8 + 5)
#define                                 I2C_DAT2_bit        _BIT_ACCESS(SSP2STAT,5)
// SSP1STAT<I2C_READ1>
extern volatile __bit                   I2C_READ1           __at(0xC7A);	// @ (0x18F * 8 + 2)
#define                                 I2C_READ1_bit       _BIT_ACCESS(SSP1STAT,2)
// SSP2STAT<I2C_READ2>
extern volatile __bit                   I2C_READ2           __at(0xCCA);	// @ (0x199 * 8 + 2)
#define                                 I2C_READ2_bit       _BIT_ACCESS(SSP2STAT,2)
// SSP1STAT<I2C_START1>
extern volatile __bit                   I2C_START1          __at(0xC7B);	// @ (0x18F * 8 + 3)
#define                                 I2C_START1_bit      _BIT_ACCESS(SSP1STAT,3)
// SSP2STAT<I2C_START2>
extern volatile __bit                   I2C_START2          __at(0xCCB);	// @ (0x199 * 8 + 3)
#define                                 I2C_START2_bit      _BIT_ACCESS(SSP2STAT,3)
// CPUDOZE<IDLEN>
extern volatile __bit                   IDLEN               __at(0x4467);	// @ (0x88C * 8 + 7)
#define                                 IDLEN_bit           _BIT_ACCESS(CPUDOZE,7)
// NCO1INCL<INC0>
extern volatile __bit                   INC0                __at(0x2C78);	// @ (0x58F * 8 + 0)
#define                                 INC0_bit            _BIT_ACCESS(NCO1INCL,0)
// NCO1INCL<INC1>
extern volatile __bit                   INC1                __at(0x2C79);	// @ (0x58F * 8 + 1)
#define                                 INC1_bit            _BIT_ACCESS(NCO1INCL,1)
// NCO1INCH<INC10>
extern volatile __bit                   INC10               __at(0x2C82);	// @ (0x590 * 8 + 2)
#define                                 INC10_bit           _BIT_ACCESS(NCO1INCH,2)
// NCO1INCH<INC11>
extern volatile __bit                   INC11               __at(0x2C83);	// @ (0x590 * 8 + 3)
#define                                 INC11_bit           _BIT_ACCESS(NCO1INCH,3)
// NCO1INCH<INC12>
extern volatile __bit                   INC12               __at(0x2C84);	// @ (0x590 * 8 + 4)
#define                                 INC12_bit           _BIT_ACCESS(NCO1INCH,4)
// NCO1INCH<INC13>
extern volatile __bit                   INC13               __at(0x2C85);	// @ (0x590 * 8 + 5)
#define                                 INC13_bit           _BIT_ACCESS(NCO1INCH,5)
// NCO1INCH<INC14>
extern volatile __bit                   INC14               __at(0x2C86);	// @ (0x590 * 8 + 6)
#define                                 INC14_bit           _BIT_ACCESS(NCO1INCH,6)
// NCO1INCH<INC15>
extern volatile __bit                   INC15               __at(0x2C87);	// @ (0x590 * 8 + 7)
#define                                 INC15_bit           _BIT_ACCESS(NCO1INCH,7)
// NCO1INCU<INC16>
extern volatile __bit                   INC16               __at(0x2C88);	// @ (0x591 * 8 + 0)
#define                                 INC16_bit           _BIT_ACCESS(NCO1INCU,0)
// NCO1INCU<INC17>
extern volatile __bit                   INC17               __at(0x2C89);	// @ (0x591 * 8 + 1)
#define                                 INC17_bit           _BIT_ACCESS(NCO1INCU,1)
// NCO1INCU<INC18>
extern volatile __bit                   INC18               __at(0x2C8A);	// @ (0x591 * 8 + 2)
#define                                 INC18_bit           _BIT_ACCESS(NCO1INCU,2)
// NCO1INCU<INC19>
extern volatile __bit                   INC19               __at(0x2C8B);	// @ (0x591 * 8 + 3)
#define                                 INC19_bit           _BIT_ACCESS(NCO1INCU,3)
// NCO1INCL<INC2>
extern volatile __bit                   INC2                __at(0x2C7A);	// @ (0x58F * 8 + 2)
#define                                 INC2_bit            _BIT_ACCESS(NCO1INCL,2)
// NCO1INCL<INC3>
extern volatile __bit                   INC3                __at(0x2C7B);	// @ (0x58F * 8 + 3)
#define                                 INC3_bit            _BIT_ACCESS(NCO1INCL,3)
// NCO1INCL<INC4>
extern volatile __bit                   INC4                __at(0x2C7C);	// @ (0x58F * 8 + 4)
#define                                 INC4_bit            _BIT_ACCESS(NCO1INCL,4)
// NCO1INCL<INC5>
extern volatile __bit                   INC5                __at(0x2C7D);	// @ (0x58F * 8 + 5)
#define                                 INC5_bit            _BIT_ACCESS(NCO1INCL,5)
// NCO1INCL<INC6>
extern volatile __bit                   INC6                __at(0x2C7E);	// @ (0x58F * 8 + 6)
#define                                 INC6_bit            _BIT_ACCESS(NCO1INCL,6)
// NCO1INCL<INC7>
extern volatile __bit                   INC7                __at(0x2C7F);	// @ (0x58F * 8 + 7)
#define                                 INC7_bit            _BIT_ACCESS(NCO1INCL,7)
// NCO1INCH<INC8>
extern volatile __bit                   INC8                __at(0x2C80);	// @ (0x590 * 8 + 0)
#define                                 INC8_bit            _BIT_ACCESS(NCO1INCH,0)
// NCO1INCH<INC9>
extern volatile __bit                   INC9                __at(0x2C81);	// @ (0x590 * 8 + 1)
#define                                 INC9_bit            _BIT_ACCESS(NCO1INCH,1)
// INLVLA<INLVA6>
extern volatile __bit                   INLVA6              __at(0xF9E6);	// @ (0x1F3C * 8 + 6)
#define                                 INLVA6_bit          _BIT_ACCESS(INLVLA,6)
// INLVLA<INLVA7>
extern volatile __bit                   INLVA7              __at(0xF9E7);	// @ (0x1F3C * 8 + 7)
#define                                 INLVA7_bit          _BIT_ACCESS(INLVLA,7)
// INLVLB<INLVB6>
extern volatile __bit                   INLVB6              __at(0xFA3E);	// @ (0x1F47 * 8 + 6)
#define                                 INLVB6_bit          _BIT_ACCESS(INLVLB,6)
// INLVLB<INLVB7>
extern volatile __bit                   INLVB7              __at(0xFA3F);	// @ (0x1F47 * 8 + 7)
#define                                 INLVB7_bit          _BIT_ACCESS(INLVLB,7)
// INLVLC<INLVC6>
extern volatile __bit                   INLVC6              __at(0xFA96);	// @ (0x1F52 * 8 + 6)
#define                                 INLVC6_bit          _BIT_ACCESS(INLVLC,6)
// INLVLC<INLVC7>
extern volatile __bit                   INLVC7              __at(0xFA97);	// @ (0x1F52 * 8 + 7)
#define                                 INLVC7_bit          _BIT_ACCESS(INLVLC,7)
// INLVLE<INLVE3>
extern volatile __bit                   INLVE3              __at(0xFB43);	// @ (0x1F68 * 8 + 3)
#define                                 INLVE3_bit          _BIT_ACCESS(INLVLE,3)
// INLVLA<INLVLA0>
extern volatile __bit                   INLVLA0             __at(0xF9E0);	// @ (0x1F3C * 8 + 0)
#define                                 INLVLA0_bit         _BIT_ACCESS(INLVLA,0)
// INLVLA<INLVLA1>
extern volatile __bit                   INLVLA1             __at(0xF9E1);	// @ (0x1F3C * 8 + 1)
#define                                 INLVLA1_bit         _BIT_ACCESS(INLVLA,1)
// INLVLA<INLVLA2>
extern volatile __bit                   INLVLA2             __at(0xF9E2);	// @ (0x1F3C * 8 + 2)
#define                                 INLVLA2_bit         _BIT_ACCESS(INLVLA,2)
// INLVLA<INLVLA3>
extern volatile __bit                   INLVLA3             __at(0xF9E3);	// @ (0x1F3C * 8 + 3)
#define                                 INLVLA3_bit         _BIT_ACCESS(INLVLA,3)
// INLVLA<INLVLA4>
extern volatile __bit                   INLVLA4             __at(0xF9E4);	// @ (0x1F3C * 8 + 4)
#define                                 INLVLA4_bit         _BIT_ACCESS(INLVLA,4)
// INLVLA<INLVLA5>
extern volatile __bit                   INLVLA5             __at(0xF9E5);	// @ (0x1F3C * 8 + 5)
#define                                 INLVLA5_bit         _BIT_ACCESS(INLVLA,5)
// INLVLB<INLVLB0>
extern volatile __bit                   INLVLB0             __at(0xFA38);	// @ (0x1F47 * 8 + 0)
#define                                 INLVLB0_bit         _BIT_ACCESS(INLVLB,0)
// INLVLB<INLVLB1>
extern volatile __bit                   INLVLB1             __at(0xFA39);	// @ (0x1F47 * 8 + 1)
#define                                 INLVLB1_bit         _BIT_ACCESS(INLVLB,1)
// INLVLB<INLVLB2>
extern volatile __bit                   INLVLB2             __at(0xFA3A);	// @ (0x1F47 * 8 + 2)
#define                                 INLVLB2_bit         _BIT_ACCESS(INLVLB,2)
// INLVLB<INLVLB3>
extern volatile __bit                   INLVLB3             __at(0xFA3B);	// @ (0x1F47 * 8 + 3)
#define                                 INLVLB3_bit         _BIT_ACCESS(INLVLB,3)
// INLVLB<INLVLB4>
extern volatile __bit                   INLVLB4             __at(0xFA3C);	// @ (0x1F47 * 8 + 4)
